Q1.How to import pandas and check the version?

"import pandas" is importing statement used in python which is used to import the pandas module.

print(pandas.version ) is used to print the version of the pandas module imported.

In [1]:
import pandas as pd
print(pd.__version__)

1.1.4

Q2.How to create a series from a numpy array?

A series can be created from numpy array using 2 different way:

1)using only numpy array value
2)using only numpy array value along user index value

In [2]:
# importing numpy and pandas
import numpy as np
import pandas as pd

# using numpy array value
data = np.array(['delhi', 'mumbai', 'kolkata', 'nagpur', 'pune']) 
  
# creating series from array 
series = pd.Series(data) 
print(series)

0      delhi
1     mumbai
2    kolkata
3     nagpur
4       pune
dtype: object

In [3]:
# importing numpy and pandas 
import numpy as np
import pandas as pd

# using numpy array value
data = np.array(['delhi', 'mumbai', 'kolkata', 'nagpur', 'pune']) 
  
# creating series from array with user index value
series = pd.Series(data, index = [1, 2, 3, 4, 5]) 
print(series)

1      delhi
2     mumbai
3    kolkata
4     nagpur
5       pune
dtype: object

Q3.How to convert the index of a series into a column of a dataframe?

In [6]:
import numpy as np
import pandas as pd

# using numpy array value
data = np.array(['delhi', 'mumbai', 'kolkata', 'nagpur', 'pune']) 
  
# creating series from array with user index value
series = pd.Series(data, index = [1, 2, 3, 4, 5]) 

# convert series to dataframe 
df = series.to_frame().reset_index()
# giving names to columns  
df.columns=["index","cities"]
# show the dataframe 
df

   index   cities
0      1    delhi
1      2   mumbai
2      3  kolkata
3      4   nagpur
4      5     pune

Q4.Write the code to list all the datasets available in seaborn library.
Load the 'mpg' dataset
Note: mpg dataset will be read from seaborn module in the manner sir has already shown(provided in the
materials folder)

In [8]:
#importing seaborn and listing the dataset available in seaborn library
import seaborn as sns
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'exercise',
 'flights',
 'fmri',
 'gammas',
 'geyser',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'tips',
 'titanic']

In [10]:
#loading the mpg dataset
data=sns.load_dataset('mpg')
data

      mpg  cylinders  ...  origin                       name
0    18.0          8  ...     usa  chevrolet chevelle malibu
1    15.0          8  ...     usa          buick skylark 320
2    18.0          8  ...     usa         plymouth satellite
3    16.0          8  ...     usa              amc rebel sst
4    17.0          8  ...     usa                ford torino
..    ...        ...  ...     ...                        ...
393  27.0          4  ...     usa            ford mustang gl
394  44.0          4  ...  europe                  vw pickup
395  32.0          4  ...     usa              dodge rampage
396  28.0          4  ...     usa                ford ranger
397  31.0          4  ...     usa                 chevy s-10

[398 rows x 9 columns]

Q5.Which country origin cars are a part of this dataset?

In [11]:
data['origin'].unique()

array(['usa', 'japan', 'europe'], dtype=object)

Q6.Extract the part of the dataframe which contains cars belonging to 'usa'

In [12]:
data[data['origin']=='usa']

      mpg  cylinders  ...  origin                       name
0    18.0          8  ...     usa  chevrolet chevelle malibu
1    15.0          8  ...     usa          buick skylark 320
2    18.0          8  ...     usa         plymouth satellite
3    16.0          8  ...     usa              amc rebel sst
4    17.0          8  ...     usa                ford torino
..    ...        ...  ...     ...                        ...
392  27.0          4  ...     usa           chevrolet camaro
393  27.0          4  ...     usa            ford mustang gl
395  32.0          4  ...     usa              dodge rampage
396  28.0          4  ...     usa                ford ranger
397  31.0          4  ...     usa                 chevy s-10

[249 rows x 9 columns]